# 42 
# 42 ÷ 2 = 21 ნაშთი 0
# 21 ÷ 2 = 10 ნაშთი 1
# 10 ÷ 2 = 5 ნაშთი 0
# 5 ÷ 2 = 2 ნაშთი 1
# 2 ÷ 2 = 1 ნაშთი 0
# 1 ÷ 2 = 0 ნაშთი 1



# 59
# 59 ÷ 2 = 29 ნაშთი 1
# 29 ÷ 2 = 14 ნაშთი 1
# 14 ÷ 2 = 7 ნაშთი 0
# 7 ÷ 2 = 3 ნაშთი 1
# 3 ÷ 2 = 1 ნაშთი 1
# 1 ÷ 2 = 0 ნაშთი 1



# 85
# 85 ÷ 2 = 42 ნაშთი 1
# 42 ÷ 2 = 21 ნაშთი 0
# 21 ÷ 2 = 10 ნაშთი 1
# 10 ÷ 2 = 5 ნაშთი 0
# 5 ÷ 2 = 2 ნაშთი 1
# 2 ÷ 2 = 1 ნაშთი 0
# 1 ÷ 2 = 0 ნაშთი 1



# 69
# 69 ÷ 2 = 34 ნაშთი 1
# 34 ÷ 2 = 17 ნაშთი 0
# 17 ÷ 2 = 8 ნაშთი 1
# 8 ÷ 2 = 4 ნაშთი 0
# 4 ÷ 2 = 2 ნაშთი 0
# 2 ÷ 2 = 1 ნაშთი 0
# 1 ÷ 2 = 0 ნაშთი 1


# ცვლადის დეკლარაცია = ცვლადის შექმნა პროგრამის მეხსიერებაში.



# ანუ, რასაც print()-ში ჩაწერ, პროგრამა აჩვენებს.

#მაგალითად: print("Hello World")  ტერმინალში გამოიტანს Hello World -ს

#პაითონი წარმოადგენს მაღალი დონის პროგრამირების დინამიურ ენას შესაძლებლობათა ფართო სპექტრით, რომლის დიზაინი ყურადღებას ამახვილებს კოდის ადვილად წაკითხვადობაზე.პაითონის სტანდარტული ბიბლიოთეკა დიდია და ყოვლელმხრივი. ის იყენებს ძალზე იშვიათ გამომყოფებს ბლოკებისთვის – აბზაცებს.

# პაითონი მულტიპარადიგმული ენაა და მოიცავს როგორც პროცედურული, იმპერატიული, ისე ფუნქციონალური პროგრამირების ელემენტებს. მას ხშირად ადარებენ ისეთ ენებს, როგორებიცაა Tcl, Perl, Ruby, Scheme და Java. პაითონის მახასიათებელთა შორის აღსანიშნავია:

#უაღრესად ცხადი, გასაგები და კითხვადი სინტაქსი
# ინტროსპექცია
# ობიექტ ორიენტირებული მიდგომის მულტიპარადიგმული დიზაინი
# სრული მოდულარულობა
# მონაცემთა უაღრესად მაღალი დონის ტიპირება
# მეტაპროგრამირება
# ფართო სტანდარტული ბიბლიოთეკა



#სტრინგი (string) ნიშნავს ტექსტურ მონაცემს — ანუ სიმბოლოების ჯაჭვს.
#მაგალითად, სიტყვა, წინადადება ან თუნდაც ერთი ასო შეიძლება იყოს სტრინგი.

# "Hello World" - ეს არის სტრინგი 

#ინტეჯერები
#მაგალითად

age = 15
year = 2025
print(age + year)

#done
